Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དགེ་སློང་དག་སྔོན་མ་ཐོས་པའི་ཆོས་རྣམས་ལ་ང་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་ལས། སྡུག་བསྔལ་འགོག་པ་འཕགས་པའི་བདེན་པ་དེ་ནི་མངོན་པར་ཤེས་པས་མངོན་སུམ་དུ་བྱས་སོ་སྙམ་དུ་མིག་སྐྱེས་སོ། །
en: “Monks, as I focused my mind correctly on the things that I had not hitherto heard, thinking, ‘With higher knowledge I have actualized the cessation of suffering, that truth of noble beings,’ vision arose;

source: དགེ་སློང་དག་སྔོན་མ་ཐོས་པའི་ཆོས་རྣམས་ལ་ང་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་ལས། སྡུག་བསྔལ་འགོག་པར་འགྱུར་བའི་ལམ་འཕགས་པའི་བདེན་པ་དེ་ནི་མངོན་པར་ཤེས་པས་བསྒོམས་སོ་སྙམ་དུ་མིག་སྐྱེས་སོ། །
en: “Monks, as I focused my mind correctly on the things that I had not hitherto heard, thinking, ‘With higher knowledge I have cultivated the path that leads to the cessation of suffering, that truth of noble beings,’ vision arose;

source: དགེ་སློང་དག་འཕགས་པའི་བདེན་པ་བཞི་ལ། དེ་ལྟར་ངའི་རབས་གསུམ་རྣམ་པ་བཅུ་གཉིས་པའི་མིག་མ་སྐྱེས། ཡེ་ཤེས་མ་སྐྱེས། རིག་པ་མ་སྐྱེས། བློ་མ་སྐྱེས་ཀྱི་བར་དུ།
en: “Monks, as long as I had not achieved the vision, knowledge, and understanding of the four truths of noble beings in their three phases and twelve aspects,

source: དགེ་སློང་དག་ང་ལྷ་དང་བཅས་པ་དང་བདུད་དང་བཅས་པ་དང་ཚངས་པ་དང་བཅས་པའི་འཇིག་རྟེན་དང་། དགེ་སྦྱོང་དང་བྲམ་ཟེ་དང་བཅས་པའི་སྐྱེ་དགུ་དང་ལྷ་དང་མི་དང་བཅས་པའི་སྐྱེ་དགུ་འདི་ལས་གྲོལ་བ་དང་ངེས་པར་བྱུང་བ་དང་། མི་ལྡན་པ་དང་རྣམ་པར་གྲོལ་བ་དང་
en: I had not been freed from the world replete with gods, māras, Brahmā, mendicants, brahmins, and humans. I had not escaped from it, severed ties with it, or been delivered from it.

source: ཕྱིན་ཅི་ལོག་དང་བྲལ་བའི་སེམས་ཀྱིས་ཤས་ཆེར་གནས་པར་ཡང་མ་གྱུར་ལ།
en: Nor did I dwell fully with a mind free from error.

source: དགེ་སློང་དག་བདག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ་སྙམ་དུ་ཡང་ངས་མ་རྟོགས་སོ། །
en: Monks, I did not have the understanding that I had fully awakened to unsurpassed and perfect buddhahood.

source: དགེ་སློང་དག་འཕགས་པའི་བདེན་པ་བཞི་ལ་དེ་ལྟར་ངའི་རབས་གསུམ་རྣམ་པ་བཅུ་གཉིས་པའི་མིག་སྐྱེས། ཡེ་ཤེས་དང་རིག་པ་དང་བློ་སྐྱེས་ནས། གདོད་དགེ་སློང་དག་ང་ལྷ་དང་བཅས་པ་དང་བདུད་དང་བཅས་པ་དང་ཚངས་པ་དང་བཅས་པའི་འཇིག་རྟེན་དང་དགེ་སྦྱོང་དང་བྲམ་ཟེ་དང་བཅས་པའི་སྐྱེ་དགུ་དང་། ལྷ་དང་མིར་བཅས་པའི་སྐྱེ་དགུ་འདི་ལས་གྲོལ་བ་དང་ངེས་པར་བྱུང་བ་དང་མི་ལྡན་པ་དང་རྣམ་པར་གྲོལ་བ་དང་
en: “Monks, once I had achieved the vision, knowledge, and understanding of the four truths of noble beings in their three phases and twelve aspects, I was freed from the world replete with gods, māras, Brahmā, mendicants, brahmins, and humans. I had escaped from it, severed ties with it, and been delivered from it.

source: ཕྱིན་ཅི་ལོག་དང་བྲལ་བའི་སེམས་ཀྱིས་ཤས་ཆེར་གནས་པར་ཡང་གྱུར་ལ། དགེ་སློང་དག་བདག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ་སྙམ་དུ་ཡང་ངས་རྟོགས་སོ། །
en: I dwelled fully with a mind free from error. Monks, then I had the understanding that I had fully awakened to unsurpassed and perfect buddhahood.”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་ཚེ་དང་ལྡན་པ་ཀཽཎྜི་ནྱ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་སྐྱེས་སོ། །
en: When the Blessed One had given this Dharma teaching, Venerable Kauṇḍinya achieved the Dharma vision that is free from dust and stainless with regard to phenomena.

source: དེ་ནས་དེར་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀཽཎྜི་ནྱ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One now asked Venerable Kauṇḍinya,

source: ཀཽཎྜི་ནྱ་ཁྱོད་ཀྱིས་ཆོས་ཀུན་ཤེས་སམ།
en: “Kauṇḍinya, have you understood the Dharma?”

source: བཅོམ་ལྡན་འདས་ཀུན་འཚལ་ལགས་སོ། །
en: “Yes, Blessed One, I have.”

source: ཀཽཎྜི་ནྱ་ཁྱོད་ཀྱིས་ཆོས་ཀུན་ཤེས་སམ། ཀུན་ཤེས་སམ།
en: “Kauṇḍinya, have you understood the Dharma? Have you understood?”

source: བདེ་བར་གཤེགས་པ་ཀུན་འཚལ་ལགས་སོ། །ཀུན་འཚལ་ལགས་སོ། །
en: “Yes, Sugata, I have understood it. I understand.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀཽཎྜི་ནྱ་ཆོས་ཀུན་ཤེས་པར་གྱུར་པས་ན། དེའི་ཕྱིར་ཚེ་དང་ལྡན་པ་ཀཽཎྜི་ནྱའི་མིང་ཀུན་ཤེས་ཀཽཎྜི་ནྱ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: “Because Venerable Kauṇḍinya has understood the Dharma, he shall be called Ājñāta­kauṇḍinya.”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་ས་ལ་གནས་པའི་གནོད་སྦྱིན་རྣམས་སྒྲ་རྗོད་ཅིང་སྐད་འབྱིན་པར་བྱེད་དེ།
en: When this Dharma teaching had been explained, the terrestrial yakṣas began to chatter and sing,

source: གྲོགས་པོ་དག་བཅོམ་ལྡན་འདས་ཀྱིས་ནི་བ་རཱ་ཎ་སཱིར་དྲང་སྲོང་སྨྲ་བ་རི་དགས་ཀྱི་ནགས་སུ་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་ཕན་པ་དང་བདེ་བའི་ཕྱིར་ཆོས་དང་འཐུན་པ།
en: “Friends, in Vārāṇasī, in the woods of the deer park at Ṛṣivadana, for the great benefit of many, to the delight of many, out of compassion for this transient world, for the well-being and benefit of gods and human beings, in accord with the Dharma,

source: རབས་གསུམ་རྣམ་པ་བཅུ་གཉིས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་
en: the Blessed One has turned the wheel of the Dharma in its three phases and twelve aspects.

source: འཇིག་རྟེན་དུ་དགེ་སྦྱོང་ངམ་བྲམ་ཟེའམ་ལྷའམ་བདུད་དམ་ཚངས་པའམ་གཞན་གང་སུ་ཡང་རུང་བས། ཆོས་དང་ལྡན་པར་མ་བསྐོར་བ་དེ་བསྐོར་གྱིས་ལྷའི་གནས་རྣམས་ནི་མངོན་པར་འཕེལ་བར་འགྱུར་རོ། །
en: In all the world, no one has turned such a wheel of Dharma in its three phases and twelve aspects—neither ascetics, brahmins, gods, māras, Brahmā himself, nor anyone else. Its turning will swell the ranks of those in the realm of the gods

source: ལྷ་མ་ཡིན་གྱི་གནས་རྣམས་ནི་ཡོངས་སུ་འགྲིབ་པར་འགྱུར་རོ་ཞེས་ཟེར་ཏོ། །
en: and diminish the number of those in the realm of the demigods.”

source: ས་ལ་གནས་པའི་གནོད་སྦྱིན་རྣམས་ཀྱི་སྒྲ་ཐོས་ནས། བར་སྣང་ལ་གནས་པའི་གནོད་སྦྱིན་རྣམས་དང་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་སུམ་ཅུ་རྩ་གསུམ་པ་རྣམས་དང་འཐབ་བྲལ་བ་རྣམས་དང་དགའ་ལྡན་པ་རྣམས་དང་འཕྲུལ་དགའ་བ་རྣམས་དང་གཞན་འཕྲུལ་དབང་བྱེད་པ་རྣམས་ཀྱང་སྒྲ་རྗོད་ཅིང་སྐད་འབྱིན་པར་བྱེད་དེསྐད་ཅིག་དེ་དང་ཐང་ཅིག་དེ་དང་ཡུད་ཙམ་དེ་དང་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་ཚངས་པའི་འཇིག་རྟེན་དུ་སྒྲ་གྲག་གོ། །
en: When they heard the terrestrial yakṣas, all the celestial yakṣas and the gods in the Abodes of the Four Great Kings, the Heaven of the Thirty-Three, the Strifeless Heaven, the Tuṣita Heaven, the Delighting in Creation Heaven, and the Heaven of the Masters of Others’ Creations also began to chatter and sing, and what they said immediately thundered throughout Brahmāloka.

source: ཚངས་རིས་ཀྱི་ལྷ་རྣམས་ཀྱང་སྒྲ་རྗོད་ཅིང་སྐད་འབྱིན་པར་བྱེད་དེ།
en: The gods of Brahmāloka also began to chatter and sing, saying,

source: རབས་གསུམ་རྣམ་པ་བཅུ་གཉིས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་འཇིག་རྟེན་དུ་དགེ་སྦྱོང་ངམ་བྲམ་ཟེའམ་ལྷའམ་བདུད་དམ་ཚངས་པའམ་གཞན་སུ་ཡང་རུང་བས་ཆོས་དང་ལྡན་པར་མ་བསྐོར་བ་དེ་བསྐོར་གྱིས།
en: the Blessed One has turned the wheel of the Dharma in its three phases and twelve aspects. “In all the world, no one has turned such a wheel of Dharma in its three phases and twelve aspects—neither ascetics, brahmins, gods, māras, Brahmā himself, nor anyone else.

source: ལྷའི་གནས་རྣམས་ནི་མངོན་པར་འཕེལ་བར་འགྱུར་རོ། །
en: Its turning will swell the ranks of those in the realm of the gods

source: བཅོམ་ལྡན་འདས་ཀྱིས་བ་རཱ་ཎ་སཱིར་དྲང་སྲོང་སྨྲ་བ་རི་དགས་ཀྱི་ནགས་སུ་ཆོས་དང་འཐུན་པ། རབས་གསུམ་རྣམ་པ་བཅུ་གཉིས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བས་ན།
en: In Vārāṇasī, in the woods of the deer park at Ṛṣivadana, in accord with the Dharma, the Blessed One has turned the wheel of the Dharma in its three phases and twelve aspects.

source: དེའི་ཕྱིར་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: That is why this Dharma discourse is known as Turning the Wheel of the Dharma.

source: དེ་ནས་དེར་ཡང་ལན་གཉིས་སུ་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་ལྔ་སྡེ་རྣམས་ལ་བཀའ་སྩལ་པ།
en: The Blessed One addressed the group of five monks a second time:

source: དགེ་སློང་དག་བཞི་པོ་འདི་དག་ནི་འཕགས་པའི་བདེན་པ་ཡིན་ཏེ།
en: “Monks, these are the four truths of noble beings:

source: སྡུག་བསྔལ་འཕགས་པའི་བདེན་པ་དང་སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་སྡུག་བསྔལ་འགོག་པ་དང་སྡུག་བསྔལ་འགོག་པར་འགྱུར་བའི་ལམ་འཕགས་པའི་བདེན་པའོ། །
en: the truth of noble beings that is suffering, the truth of noble beings that is the origin of suffering, the truth of noble beings that is the cessation of suffering, and the truth of noble beings that is the path leading to the cessation of suffering.

source: སྡུག་བསྔལ་འཕགས་པའི་བདེན་པ་གང་ཞེ་ན།
en: “What is the truth of noble beings that is suffering?

source: སྐྱེ་བའི་སྡུག་བསྔལ་དང་རྒ་བའི་སྡུག་བསྔལ་དང་ན་བའི་སྡུག་བསྔལ་དང་འཆི་བའི་སྡུག་བསྔལ་དང་
en: It is the suffering of birth, the suffering of aging, the suffering of sickness, and the suffering of death.

source: སྡུག་པ་དང་བྲལ་བའི་སྡུག་བསྔལ་དང་མི་སྡུག་པ་དང་ཕྲད་པའི་སྡུག་བསྔལ་དང་
en: It is the suffering of not having what you want, the suffering of getting what you don’t want,

source: གང་འདོད་པ་བཙལ་ཏེ་མི་རྙེད་པ་
en: and the suffering of seeking what you desire and not finding it.

source: དེ་ཡང་སྡུག་བསྔལ་བ་དང་མདོར་ན་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ནི་སྡུག་བསྔལ་བ་སྟེ།
en: In short, it is the suffering of the five aggregates for appropriation.

source: འདི་ནི་སྡུག་བསྔལ་འཕགས་པའི་བདེན་པ་ཞེས་བྱའོ། །
en: This is known as the truth of the noble ones that is suffering.

source: དེ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡང་དག་པའི་ལྟ་བ་དང་ཡང་དག་པའི་རྟོག་པ་དང་ཡང་དག་པའི་ངག་དང་ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་ཡང་དག་པའི་འཚོ་བ་དང་ཡང་དག་པའི་རྩོལ་བ་དང་ཡང་དག་པའི་དྲན་པ་དང་བརྒྱད་པ་སྟེ་ཡང་དག་པའི་ཏིང་ངེ་འཛིན་བསྒོམ་པར་བྱའོ། །
en: In order to comprehend it one should cultivate the noble eightfold path: right view, right understanding, right speech, right action, right livelihood, right effort, right mindfulness, and the eighth, right meditative concentration.

source: སྡུག་བསྔལ་ཀུན་འབྱུང་བ་འཕགས་པའི་བདེན་པ་གང་ཞེ་ན།
en: “What is the truth of the noble ones that is the origin of suffering?

source: ཡང་སྲིད་པར་སྐྱེ་བར་བྱེད་པ་དང་དགའ་བ་དང་འདོད་ཆགས་སྤེལ་མར་འབྱུང་བ་དང་དེ་དང་དེར་མངོན་པར་དགའ་བའི་སྲེད་པ་སྟེ།
en: It is what causes you to take rebirth. It is the arising of delight that is bound up with attachment. It is craving that is captivated by this and that.

source: འདི་ནི་སྡུག་བསྔལ་ཀུན་འབྱུང་བ་འཕགས་པའི་བདེན་པ་ཞེས་བྱའོ། །
en: This is what we call the truth of the noble ones that is the origin of suffering.

source: དེ་སྤང་བའི་ཕྱིར་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡང་དག་པའི་ལྟ་བ་དང་ཡང་དག་པའི་རྟོག་པ་དང་ཡང་དག་པའི་ངག་དང་ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་ཡང་དག་པའི་འཚོ་བ་དང་ཡང་དག་པའི་རྩོལ་བ་དང་ཡང་དག་པའི་དྲན་པ་དང་བརྒྱད་པ་སྟེ་ཡང་དག་པའི་ཏིང་ངེ་འཛིན་བསྒོམ་པར་བྱའོ། །
en: In order to relinquish it, one should cultivate the noble eightfold path: right view, right understanding, right speech, right action, right livelihood, right effort, right mindfulness, and the eighth, right meditative concentration.

source: སྡུག་བསྔལ་འགོག་པ་འཕགས་པའི་བདེན་པ་གང་ཞེ་ན།
en: “What is the truth of the noble ones that is the cessation of suffering?

source: ཡང་སྲིད་པར་སྐྱེ་བར་བྱེད་པ་དང་དགའ་བ་དང་འདོད་ཆགས་སྤེལ་མར་འབྱུང་བ་དང་དེ་དང་དེར་མངོན་པར་དགའ་བའི་སྲེད་པ་གང་ཡིན་པ་དེ་ཉིད་མ་ལུས་པར་སྤངས་པ་དང་བོར་བ་དང་བསལ་བ་དང་ཟད་པ་དང་བྲལ་བ་དང་འགོག་པ་དང་ཉེ་བར་ཞི་བ་དང་ནུབ་པ་སྟེ།
en: It is the complete casting away, tossing aside, clearing out, exhaustion, removal, cessation, alleviation, and disappearance of any and every single thing that causes you to take rebirth; the disappearance of delight that is bound up with attachment; and the disappearance of craving that is captivated by this and that.

source: འདི་ནི་སྡུག་བསྔལ་འགོག་པ་འཕགས་པའི་བདེན་པ་ཞེས་བྱའོ། །
en: This is what we call the truth of the noble ones that is the cessation of suffering.

source: དེ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡང་དག་པའི་ལྟ་བ་དང་ཡང་དག་པའི་རྟོག་པ་དང་ཡང་དག་པའི་ངག་དང་ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་ཡང་དག་པའི་འཚོ་བ་དང་ཡང་དག་པའི་རྩོལ་བ་དང་ཡང་དག་པའི་དྲན་པ་དང་བརྒྱད་པ་སྟེ་ཡང་དག་པའི་ཏིང་ངེ་འཛིན་བསྒོམ་པར་བྱའོ། །
en: In order to actualize it, one should cultivate the noble eightfold path: right view, right understanding, right speech, right action, right livelihood, right effort, right mindfulness, and the eighth, right meditative concentration.

source: སྡུག་བསྔལ་འགོག་པར་འགྱུར་བའི་ལམ་འཕགས་པའི་བདེན་པ་གང་ཞེ་ན།
en: “What is the noble truth of the path leading to the cessation of suffering?

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྟེ།
en: It is the noble eightfold path.

source: འདི་ལྟ་སྟེ་ཡང་དག་པའི་ལྟ་བ་དང་ཡང་དག་པའི་རྟོག་པ་དང་ཡང་དག་པའི་ངག་དང་ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་ཡང་དག་པའི་འཚོ་བ་དང་ཡང་དག་པའི་རྩོལ་བ་དང་ཡང་དག་པའི་དྲན་པ་དང་བརྒྱད་པ་སྟེ་ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཏེ་དེ་ཡང་བསྒོམ་པར་བྱའོ། །
en: One should thus cultivate right view, right understanding, right speech, right action, right livelihood, right effort, right mindfulness, and the eighth, right meditative concentration.”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་ཚེ་དང་ལྡན་པ་ཀུན་ཤེས་ཀཽཎྜི་ནྱ་ནི། ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: When this Dharma teaching had been explained, Venerable Ājñāta­kauṇḍinya’s mind was freed from the defilements, without any further appropriation.

source: དགེ་སློང་ལྔ་སྡེ་གཞན་རྣམས་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་སྐྱེས་སོ། །
en: The others among the five monks achieved the Dharma vision that is free from dust and stainless with regard to phenomena.

source: དེའི་ཚེ་འཇིག་རྟེན་དུ་དགྲ་བཅོམ་པ་གཅིག་བྱུང་སྟེ།
en: At that moment the first arhat came into the world.

source: བཅོམ་ལྡན་འདས་དང་གཉིས་སོ། །
en: Including the Blessed One, now there were two.

source: དེར་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་ལྔ་སྡེ་གཞན་རྣམས་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then addressed the other monks in the group of five:

source: དགེ་སློང་དག་གཟུགས་ནི་བདག་མ་ཡིན་ནོ། །
en: “Monks, form is not the self.

source: དགེ་སློང་དག་གལ་ཏེ་གཟུགས་བདག་ཡིན་དུ་ཟིན་ན་གཟུགས་གནོད་པ་དང་སྡུག་བསྔལ་བར་འགྱུར་བར་མི་རིགས་ལ། གཟུགས་ལ་བདག་གི་གཟུགས་འདི་ལྟ་བུར་གྱུར་ཅིག །འདི་ལྟ་བུར་མ་གྱུར་ཅིག་ཅེས་བྱ་བའི་དབང་ཡང་ཡོད་པར་འགྱུར་བར་རིགས་ན།
en: Monks, if form were the self, then it would not be logical that form is subject to injury and suffering, and it would be logical for one to be able to say, with respect to form, ‘May my form be like this,’ or ‘May it not be like this.’

source: དགེ་སློང་དག་གང་གི་ཕྱིར་གཟུགས་བདག་མ་ཡིན་པ་དེའི་ཕྱིར། གཟུགས་གནོད་པ་དང་གཟུགས་སྡུག་བསྔལ་བར་ཡང་འགྱུར་ལ། གཟུགས་ལ་བདག་གི་གཟུགས་འདི་ལྟ་བུར་གྱུར་ཅིག །འདི་ལྟ་བུར་མ་གྱུར་ཅིག་ཅེས་བྱ་བའི་དབང་ཡང་མེད་དོ། །
en: However, monks, form is subject to injury and suffering, and one is not able to say, ‘May my form be like this,’ or ‘May it not be like this,’ because form is not the self.

source: དགེ་སློང་དག་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་རྣམས་དང་རྣམ་པར་ཤེས་པ་ནི་བདག་མ་ཡིན་ནོ། །
en: “Monks, sensations, perceptions, formations, and consciousness are not the self.

source: དགེ་སློང་དག་གལ་ཏེ་རྣམ་པར་ཤེས་པ་བདག་ཡིན་དུ་ཟིན་ན། རྣམ་པར་ཤེས་པ་གནོད་པ་དང་སྡུག་བསྔལ་བར་འགྱུར་བར་མི་རིགས་ལ། རྣམ་པར་ཤེས་པ་ལ་བདག་གི་རྣམ་པར་ཤེས་པ་འདི་ལྟ་བུར་གྱུར་ཅིག །འདི་ལྟ་བུར་མ་གྱུར་ཅིག་ཅེས་བྱ་བའི་དབང་ཡང་ཡོད་པར་འགྱུར་བར་རིགས་ན།
en: Monks, if consciousness were the self, then it would not be logical that it is subject to injury and suffering, and it would be logical for one to have the ability with respect to consciousness to say, ‘May my consciousness be like this,’ or ‘May it not be like this.’

source: དགེ་སློང་དག་གང་གི་ཕྱིར་རྣམ་པར་ཤེས་པ་བདག་མ་ཡིན་པ་དེའི་ཕྱིར། རྣམ་པར་ཤེས་པ་གནོད་པ་དང་སྡུག་བསྔལ་བར་ཡང་འགྱུར་ལ། རྣམ་པར་ཤེས་པ་ལ་བདག་གི་གཟུགས་འདི་ལྟ་བུར་གྱུར་ཅིག །འདི་ལྟ་བུར་མ་གྱུར་ཅིག་ཅེས་བྱ་བའི་དབང་ཡང་མེད་དོ། །
en: However, monks, consciousness is subject to injury and suffering, and one does not have the ability with respect to consciousness to say, ‘May my consciousness be like this,’ or ‘May it not be like this,’ because consciousness is not the self.

source: དགེ་སློང་དག་ཇི་སྙམ་དུ་སེམས་གཟུགས་རྟག་པ་ཡིན་ནམ་འོན་ཏེ་མི་རྟག་པ་ཡིན།
en: “O monks, what do you think—is form permanent, or is it impermanent?”

source: བཙུན་པ་དེ་ནི་མི་རྟག་པ་ལགས་སོ། །
en: “It is impermanent, Lord.”

source: མི་རྟག་པ་གང་ཡིན་པ་དེ་སྡུག་བསྔལ་བ་ཡིན་ནམ་འོན་ཏེ་སྡུག་བསྔལ་བ་མ་ཡིན།
en: “And is something that is impermanent suffering, or is it not suffering?”

source: བཙུན་པ་དེ་ནི་སྡུག་བསྔལ་བ་ལགས་སོ། །
en: “It is suffering, Lord.”

source: ཅི་མི་རྟག་པ་དང་སྡུག་བསྔལ་བ་དང་འགྱུར་བའི་ཆོས་ཅན་གང་ཡིན་པ་དེ་ལ། ཐོས་པ་དང་ལྡན་པའི་འཕགས་པ་ཉན་ཐོས་རྣམས་འདི་ནི་བདག་གིའོ། །འདི་ནི་བདག་གོ། །འདི་ནི་བདག་གི་བདག་གོ་སྙམ་དུ་བདག་ཏུ་འཛིན་པར་བྱེད་དམ།
en: “Regarding those things that are impermanent and, therefore, suffering—do noble listeners who are educated in the teachings grasp at a self, thinking, ‘This is mine,’ ‘This is the self,’ or ‘This is the nature of the self’?”

source: བཙུན་པ་འཛིན་པར་མི་བགྱིད་ལགས་སོ། །
en: “No, Lord, they do not.”

source: དགེ་སློང་དག་ཇི་སྙམ་དུ་སེམས། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་རྣམས་དང་རྣམ་པར་ཤེས་པ་རྟག་པ་ཡིན་ནམ་འོན་ཏེ་མི་རྟག་པ་ཡིན།
en: “O monks, what do you think—are sensations, perceptions, formations, and consciousness permanent or impermanent?”

source: ཅི་མི་རྟག་པ་དང་སྡུག་བསྔལ་བ་དང་རྣམ་པར་འགྱུར་བའི་ཆོས་ཅན་གང་ཡིན་པ་དེ་ལ་ཐོས་པ་དང་ལྡན་པའི་འཕགས་པ་ཉན་ཐོས་རྣམས་འདི་ནི་བདག་གིའོ། །འདི་ནི་བདག་གོ། །འདི་ནི་བདག་གི་བདག་གོ་སྙམ་དུ་བདག་ཏུ་འཛིན་པར་བྱེད་དམ།
en: “Regarding those things that are impermanent and, therefore, suffering—do noble listeners who are educated in the teachings grasp at a self, thinking, ‘This is mine,’ ‘This is the self,’ or ‘This is the nature of the self’?”

source: དགེ་སློང་དག་དེ་བས་ན་གཟུགས་ཅི་ཡང་རུང་སྟེ། འདས་པ་དང་མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བ་དང་ནང་གིའམ་ཕྱི་རོལ་གྱིའམ་རགས་པའམ་ཆ་ཕྲ་བ་འམ་ངན་པའམ་བཟང་པོའམ་ཐག་རིང་བའམ་ཉེ་བ་དེ་དག་ཐམས་ཅད་ལ་འདི་ནི་བདག་གི་མ་ཡིན་ནོ། །འདི་ནི་བདག་མ་ཡིན་ནོ། །འདི་ནི་བདག་གི་བདག་མ་ཡིན་ནོ་སྙམ་དུ་དེ་དེ་ལྟར་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་ཇི་ལྟ་བ་བཞིན་དུ་བལྟ་བར་བྱའོ། །
en: “Monks, that is why whatever the form—whether it arose in the past, present, or future, or whether it is internal or external, gross or subtle, bad or good, near or far away—one should view all of these with perfect wisdom, thinking, ‘This is not mine,’ ‘This is not the self,’ and ‘This is not the nature of the self.’

source: དགེ་སློང་དག་ཚོར་བ་ཅི་ཡང་རུང་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་རྣམས་དང་རྣམ་པར་ཤེས་པ་ཅི་ཡང་རུང་སྟེ། འདས་པ་དང་མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བ་དང་ནང་གིའམ་ཕྱི་རོལ་གྱིའམ་རགས་པའམ་ཆ་ཕྲ་བའམ་ངན་པའམ་བཟང་པོའམ་ཐག་རིང་བའམ་ཉེ་བ་དེ་དག་ཐམས་ཅད་ལ་འདི་ནི་བདག་གི་མ་ཡིན་ནོ། །འདི་ནི་བདག་མ་ཡིན་ནོ། །འདི་ནི་བདག་གི་བདག་མ་ཡིན་ནོ་སྙམ་དུ་དེ་དེ་ལྟར་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་ཇི་ལྟ་བ་བཞིན་དུ་བལྟ་བར་བྱའོ། །
en: “Monks, that is why whatever the sensation, perception, formation, and consciousness—whether it arose in the past, present, or future, or whether it is internal or external, gross or subtle, bad or good, near or far away—one should view all of these with perfect wisdom, thinking, ‘This is not mine,’ ‘This is not the self,’ and ‘This is not the nature of the self.’

source: དགེ་སློང་དག་དེ་བས་ན་ཐོས་པ་དང་ལྡན་པའི་འཕགས་པ་ཉན་ཐོས་ཀྱིས་ནི་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་པོ་འདི་དག་བདག་ཀྱང་མ་ཡིན། བདག་གི་ཡང་མ་ཡིན་པར་ཡང་དག་པར་མཐོང་ངོ་། །
en: “Monks, this is why noble listeners who are educated in the teachings see perfectly that these five aggregates for appropriation are not ‘mine,’ are not the self, and are not the nature of the self.

source: དེས་དེ་ལྟར་ཡང་དག་པར་མཐོང་བས་ན་འཇིག་རྟེན་ཅི་ཡང་མི་ལེན་ཏོ། །
en: Since they see this so perfectly, they do not grasp at any worldly thing.

source: མི་ལེན་པས་ན་ཡོངས་སུ་ཡི་འཆད་པ་མེད་དོ། །
en: Since they do not grasp, they experience absolutely no discontentment.

source: ཡོངས་སུ་ཡི་འཆད་པ་མེད་པས་ན་བདག་གི་སྐྱེ་བ་ཟད་དོ། །
en: Because they have no discontentment, they bring an end to their own rebirth.

source: ཚངས་པར་སྤྱད་པ་སྤྱད་ཟིན་ཏོ། །
en: With the thought, ‘I have lived the conduct leading to liberation.

source: བྱ་བ་བྱས་སོ། །
en: I have done what was before me.

source: སྲིད་པ་འདི་ལས་གཞན་མེད་དོ་སྙམ་དུ་རང་ཉིད་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ། །
en: I shall know no other existence,’ they pass into parinirvāṇa.”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་དགེ་སློང་ལྔ་སྡེ་པོ་གཞན་རྣམས་ཀྱང་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: When he explained this Dharma teaching, the minds of the others among the group of five monks were freed from the defilements, without any further appropriation.

source: དེའི་ཚེ་འཇིག་རྟེན་དུ་དགྲ་བཅོམ་པ་ལྔ་བྱུང་སྟེ།
en: As of that moment, five arhats had come into the world.

source: བཅོམ་ལྡན་འདས་དང་དྲུག་གོ། །
en: Including the Blessed One, now there were six.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་ལྔ་སྡེ་རྣམས་འཁོར་བའི་རྒྱ་མཚོ་ལས་བསྒྲལ་ཏེ་དབང་པོ་དང་སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་རིན་པོ་ཆེ་རྣམས་ཀྱི་སྐལ་ཤས་སྩལ་ནསགཡུང་དྲུང་གི་མཐར་ཐུག་པའི་གྲུབ་པ་དང་བདེ་བ་མྱ་ངན་ལས་འདས་པ་ལ་བཀོད་པ་ལ་གཟིགས།
en: “Lord, tell us why the Blessed One has delivered our group of five monks from the ocean of saṃsāra, given us the great fortune of power, strength, and the precious limbs of enlightenment, and established us in the unsurpassed, supreme welfare of nirvāṇa.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ་འདས་པའི་དུས་ན་ཡང་ངས་དགེ་སློང་ལྔ་སྡེ་པོ་འདི་རྣམས་ལ་བདག་གི་སྲོག་དང་བསྡོས་ཏེཆུའི་རྒྱ་མཚོ་ཆེན་པོ་ལས་བསྒྲལ་ནས། རིན་ཐང་ཆེ་བའི་རིན་པོ་ཆེ་རྣམས་ཀྱི་སྐལ་ཤས་ཇི་ལྟར་བྱིན་པ་དེ་ཉོན་ཅིག །
en: “Not only now, monks” the Blessed One explained, “but in times past as well, and in the same way, I risked my life to deliver your group of five monks from the ocean of defilements and granted you a magnificent fortune of precious jewels. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བ་རཱ་ཎ་སཱིའི་གྲོང་ཁྱེར་ན་རྒྱལ་པོ་ཚངས་པས་བྱིན་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ།
en: “Monks, in times past there was a king named King Brahmadatta who reigned in the city of Vārāṇasī.

source: དེའི་རིང་ལ་འབྱོར་པ་དང་རྒྱས་པ་དང་། བདེ་བ་དང་ལོ་ལེགས་པ་དང་སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་དང་རྩོད་པ་དང་འཐབ་པ་ཞི་བ་དང་འཁྲུག་པ་དང་ནང་འཁྲུག་དང་ཆོམ་རྐུན་དང་ནད་དང་མུ་གེ་མེད་པ་དང་འབྲས་སཱ་ལུ་དང་བུ་རམ་ཤིང་དང་བ་ལང་དང་མ་ཧེ་དང་ལྡན་པར་འདུག་སྟེ
en: His kingdom was prosperous, flourishing, happy, and well populated. The harvest was good. Quarreling and arguments had ceased, there was no fighting or infighting, and there were no robbers, thieves, illness, or famine. Rice, sugarcane, cattle, and buffalo were plentiful.

source: གནོད་པ་མེད་ཅིང་ཚེར་མ་དཀྲུགས་ལ་བུ་གཅིག་པ་སྡུག་པ་ལ་བྱ་བ་བཞིན་དུ་ཆོས་བཞིན་དུ་རྒྱལ་སྲིད་བྱེད་དོ། །
en: His was a reign in accord with the Dharma. He ruled the kingdom gently and mercifully, as a parent cares for a beloved only child.

source: དེའི་ཚེ་བཱ་རཱ་ཎ་སཱི་ན་དེད་དཔོན་དབྱིག་ཅེས་བྱ་བ་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ་ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་དེས།
en: “At that time in Vārāṇasī there lived a certain sea captain by the name of Wealth . He was prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས། དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་དགའ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་དོ། །
en: When the time came for him to marry he took a wife, and they enjoyed themselves and coupled.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས་
en: As they enjoyed themselves and coupled, one day his wife conceived.

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་མདོག་བཟང་བ། གསེར་གྱི་ཁ་དོག་ཅན་མགོ་བོ་གདུགས་ལྟར་འདུག་པ་ལག་པ་རིང་བ་དཔྲལ་བའི་དབྱེས་ཆེ་བ་སྣ་མཐོ་བ་སྣ་ལེགས་པ་སྨིན་མ་སྟུག་པ་ཞིག་བཙས་ཏེ
en: After nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful, with glowing, golden skin and a well-rounded head, long arms, a broad brow, a fine and prominent nose, and eyebrows that met.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས་ཁྱེའུ་འདིའི་མིང་ཇི་སྐད་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དེ།
en: “At the elaborate feast celebrating his birth they asked, ‘What name should we give this child?’

source: ཁྱེའུ་འདི་དབྱིག་གི་བུ་ཡིན་གྱིས་ཁྱེའུ་འདིའི་མིང་དབྱིག་དགའ་ཞེས་གདགས་སོ་ཟེར་རོ། །
en: And they named him, saying, ‘Since this is the child of Wealth , his name will be Wealth’s Delight.’

source: དེ་ནས་ཁྱེའུ་དབྱིག་དགའ་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ་མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: They reared young Wealth’s Delight on milk, yogurt, butter, ghee, and milk solids, and he flourished like a lotus in a lake.

source: དེ་ནས་དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡི་གེ་དང་ཁོང་རྩིས་དང་ཤོད་དགོད་པ་དང་།
en: “As he grew up he studied letters, tallying, and arithmetic;
